propeller_fine/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Meshing
runApplication blockMesh
runApplication surfaceFeatures
runApplication snappyHexMesh
runApplication decomposePar
runParallel foamRun
runApplication reconstructPar -newTimes
#------------------------------------------------------------------------------
